robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_ems004.c
}

#endif//HAL_USE_SPI4ENCODER



#ifdef HAL_USE_SWITCH  

#if 0
static void hal_brdcfg_switch__mco1_init(void)
{
    // configure pa8 af, push pull, 50mhz
    // enable system configuration controller clock
    RCC->APB2ENR    |= (1 << 14);  
    // clocks port port a
    RCC->AHB1ENR    |= 0x00000001;

    GPIOA->MODER   &= ~0x00030000;              // reset pa8
    GPIOA->MODER   |=  0x00020000;              // alternate function
    GPIOA->OTYPER  &= ~0x00000100;              // output push-pull (reset state)  
    GPIOA->OSPEEDR |=  0x00030000;              // slew rate as 100MHz pin (3) or 50mhz (2)
    GPIOA->PUPDR   &= ~0x00030000;              // no pull up, pull down

    GPIOA->AFR[1]  &= ~0x0000000F;
    GPIOA->AFR[1]  |=  0x00000000;              // AF0 (system) 

}
#endif

static void hal_brdcfg_switch__mco2_init(void)
{
    #define SLR100MHZ               0x000C0000
    #define SLR050MHZ               0x00080000
    // configure pc9 af, push pull, 50mhz
    // enable system configuration controller clock
    RCC->APB2ENR    |= (1 << 14);  
    // clocks port port c
    RCC->AHB1ENR    |= 0x00000004;

    GPIOC->MODER    &= ~0x000C0000;              // reset pc9
    GPIOC->MODER    |=  0x00080000;              // alternate function
    GPIOC->OTYPER   &= ~0x00000200;              // output push-pull (reset state)  
    GPIOC->OSPEEDR  |=  SLR100MHZ;               // slew rate as 100MHz pin (0x000C0000) or 50mhz (0x00080000)
    GPIOC->PUPDR    &= ~0x000C0000;              // no pull up, pull down

    GPIOC->AFR[1]   &= ~0x000000F0;
    GPIOC->AFR[1]   |=  0x00000000;              // AF0 (system) 
}

static void hal_brdcfg_switch__mco_initialise(void)
{

    hal_brdcfg_switch__mco2_init();
     
    RCC_PLLI2SCmd(DISABLE);
    RCC_PLLI2SConfig(200, 2); // 50mhz: 1mhz*200/10 = 100
    RCC_PLLI2SCmd(ENABLE);
    // wait until it is ready
    while(RCC_GetFlagStatus(RCC_FLAG_PLLI2SRDY) == RESET);
    // connect mco2 with plli2s divided by 2
    RCC_MCO2Config(RCC_MCO2Source_PLLI2SCLK, RCC_MCO2Div_2);

    //hal_eth_hid_rmii_refclock_init();
}

void hal_brdcfg_switch__rmii_init(void)
{
    hal_eth_hid_rmii_prepare();
    hal_eth_hid_rmii_rx_init(); 
    hal_eth_hid_rmii_tx_init(); 
    hal_eth_hid_rmii_refclock_init();  
    hal_eth_hid_smi_init();    
}

extern void hal_brdcfg_switch__initialise(void)
{
    
    // --- mco2: PC9
//    hal_brdcfg_switch__mco_initialise();  
    
     // --- reset pin: PB2
    hal_gpio_init(hal_gpio_portB, hal_gpio_pin2, hal_gpio_dirOUT, hal_gpio_speed_low);
    hal_gpio_setval(hal_gpio_portB, hal_gpio_pin2, hal_gpio_valLOW);
    hal_sys_delay(10*1000);
    hal_gpio_setval(hal_gpio_portB, hal_gpio_pin2, hal_gpio_valHIGH);
    hal_sys_delay(100);
  
    // proviamo anche questo ....
//    hal_eth_hid_rmii_refclock_init();
    
    // --- mco: PC9
    hal_brdcfg_switch__mco_initialise();  
    
    //hal_brdcfg_switch__rmii_init();

    // --- i2c for communication 
    hal_i2c4hal_init(hal_i2c_port1, NULL); // use default configuration    

}

static void s_hal_brdcfg_switch__mii_phymode_get(hal_eth_phymode_t* phymode)
{
    #define MIIHALFD    (1 << 6)
    #define MII10MBS    (1 << 4)
    uint8_t read = 0xFF; 
    hal_i2c_regaddr_t regadr = {.numofbytes = 1, .bytes.one = 0};
    regadr.bytes.one = 0x06;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &read, 1);
    if( (MIIHALFD & read) == MIIHALFD)
    {
        phymode->mux = hal_eth_mux_halfduplex;
    }
    else
    {
        phymode->mux = hal_eth_mux_fullduplex;
    }
    if( (MII10MBS & read) == MII10MBS)
    {
        phymode->speed = hal_eth_speed_10;
    }
    else
    {
        phymode->speed = hal_eth_speed_100;
    }
}
 
extern void hal_brdcfg_switch__configure(hal_eth_phymode_t* phymode)
{
    hal_eth_phymode_t phymode2use = {.mux = hal_eth_mux_fullduplex, .speed = hal_eth_speed_100};
    const uint8_t fd100 = 0x60;
    const uint8_t fd010 = 0x20;
    uint8_t buff_write = 0x60; // FORCE FULL DUPLEX AND 100T
    uint8_t buff_read = 0xFF; 
    volatile uint32_t i = 1;
    hal_i2c_regaddr_t regadr = {.numofbytes = 1, .bytes.one = 0};
    
    if(NULL != phymode)
    {
        memcpy(&phymode2use, phymode, sizeof(hal_eth_phymode_t));
    }

    regadr.bytes.one = 0x01;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    if((buff_read&0x01))
    {   // already initted. to be initted again must pass through a reset
        s_hal_brdcfg_switch__mii_phymode_get(phymode);
        return;
    }
    
    
//    if((hal_eth_mux_auto == phymode2use.mux) || (hal_eth_mux_none == phymode2use.mux) || (hal_eth_speed_auto == phymode2use.speed) || (hal_eth_speed_none == phymode2use.speed))
    if((hal_eth_mux_none == phymode2use.mux) || (hal_eth_speed_none == phymode2use.speed))
    {
        if(NULL != phymode)
        {
            phymode->speed  = hal_eth_speed_none;
            phymode->mux    = hal_eth_mux_none;        
        }   
        return;        
    }


    

#if 0    
    // configure mii
    regadr.bytes.one = 0x06;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    buff_write  = buff_read;
    buff_write |= 0x10; 
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
#endif

    // 1. configure  switch's ports 1 and 2
    if((hal_eth_mux_auto == phymode2use.mux) || (hal_eth_speed_auto == phymode2use.speed))
    {
        buff_write = 0x9F;
    }
    else    
    {
        buff_write  = 0;
        buff_write  = (hal_eth_speed_100 == phymode2use.speed)    ? (0x40) : (0x00);     
        buff_write |= (hal_eth_mux_fullduplex == phymode2use.mux) ? (0x20) : (0x00);  
    }
    
    // port 1
    regadr.bytes.one = 0x1C;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
     
    // port 2 
    regadr.bytes.one = 0x2C;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);   
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);

