robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_ems004.c
    // 2. start the switch
    buff_write = 0x1;  
    regadr.bytes.one = 0x01;    
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    

    // 3. read back to verify
    regadr.bytes.one = 0x01;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    if(!(buff_read&0x01))
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_runtimefault, "s_hal_switch_reg_config(): SWITCH not configured");
    }
    
    s_hal_brdcfg_switch__mii_phymode_get(phymode);
    
//    if(NULL != phymode)
//    {
//        phymode->speed = hal_eth_speed_100; // the one of mii
//        phymode->mux   = phymode2use.mux;
//    }

}

#endif//HAL_USE_SWITCH



#ifdef HAL_USE_ETH

extern hal_bool_t hal_brdcfg_eth__phy_initialise(void)
{
    #warning --> in here we just init the switch ... put in reset mode, exit from reset, do the mco, init the i2c if not initted, etc. 
    if(hal_false == hal_switch_initted_is())
    {
        hal_switch_init(NULL);
    }
    
    return(hal_true);
}

extern void hal_brdcfg_eth__phy_configure(hal_eth_phymode_t *phymode)
{
    hal_eth_phymode_t target;
    memcpy(&target, &hal_brdcfg_eth__phymode, sizeof(hal_eth_phymode_t));
    
    hal_switch_start(&target);
    
    if(NULL != phymode)
    {
        phymode->speed  = target.speed;
        phymode->mux    = target.mux;         
    }
}

#endif//HAL_USE_ETH

#ifdef HAL_USE_SYS
extern void hal_brdcfg_sys__clock_config(void)
{

}


extern void hal_brdcfg_sys__gpio_default_init(void)
{

}
#endif

// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------


